shreym01/SE423_repo/F28379dSerial_withLCDcontrast.c
//for serialD
#ifdef _FLASH
#pragma CODE_SECTION(TXDINT_data_sent, ".TI.ramfunc");
#endif
__interrupt void TXDINT_data_sent(void)
{
    char data;
    if (buf_readSCID_1(&SerialD.TX,0,&data) == 0) {
        while ( (buf_readSCID_1(&SerialD.TX,0,&data) == 0)
                && (SerialD.sci->SCIFFTX.bit.TXFFST != 0x10) ) {
            buf_removeSCID(&SerialD.TX, 1);
            SerialD.sci->SCITXBUF.all = data;
        }
    } else {
        SerialD.sci->SCIFFTX.bit.TXFFIENA = 0;      // TX: disable fifo interrupt
    }
    SerialD.sci->SCIFFTX.bit.TXFFINTCLR = 1;  // TX: clear interrupt flag
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP8;
}

//for SerialA
#ifdef _FLASH
#pragma CODE_SECTION(RXAINT_recv_ready, ".TI.ramfunc");
#endif
__interrupt void RXAINT_recv_ready(void)
{
    RXAdata = SciaRegs.SCIRXBUF.all;

    /* SCI PE or FE error */
    if (RXAdata & 0xC000) {
        SciaRegs.SCICTL1.bit.SWRESET = 0;
        SciaRegs.SCICTL1.bit.SWRESET = 1;
        SciaRegs.SCIFFRX.bit.RXFIFORESET = 0;
        SciaRegs.SCIFFRX.bit.RXFIFORESET = 1;
    } else {
        RXAdata = RXAdata & 0x00FF;
        if (COMA_state == 0) {

            if (RXAdata == '*') {
                COMA_state = 1; //for receiving path
            } else {
                COMA_state = 0;
            }
        } else if (COMA_state == 1) {

            if (RXAdata == '*') {
                COMA_state = 10; // into the read mode
                received_CAM_countThreshold1 = 0;
            } else if (RXAdata == '!') {
                COMA_state = 20; // into the read mode
                received_CAM_countThreshold2 = 0;
            } else {
                COMA_state = 0;
            }
        } else if (COMA_state == 10) {

            if ((received_CAM_countThreshold1 % 2) == 0) {
                COMALSB = RXAdata;
            } else {
                DataFromCameraThreshold1.rawData[received_CAM_countThreshold1/2] = (RXAdata << 8) | COMALSB;
            }
            received_CAM_countThreshold1++;
            if (received_CAM_countThreshold1 >= 4*CAMNUM_FROM_FLOATS) {
                received_CAM_countThreshold1 = 0;
                COMA_state = 0;
                fromCAMvaluesThreshold1[0] = DataFromCameraThreshold1.floatData[0];
                fromCAMvaluesThreshold1[1] = DataFromCameraThreshold1.floatData[1];
                fromCAMvaluesThreshold1[2] = DataFromCameraThreshold1.floatData[2];
                fromCAMvaluesThreshold1[3] = DataFromCameraThreshold1.floatData[3];
                fromCAMvaluesThreshold1[4] = DataFromCameraThreshold1.floatData[4];
                fromCAMvaluesThreshold1[5] = DataFromCameraThreshold1.floatData[5];
                fromCAMvaluesThreshold1[6] = DataFromCameraThreshold1.floatData[6];
                fromCAMvaluesThreshold1[7] = DataFromCameraThreshold1.floatData[7];
                fromCAMvaluesThreshold1[8] = DataFromCameraThreshold1.floatData[8];
                NewCAMDataThreshold1 = 1;  // Flag new data
            }
        } else if (COMA_state == 20) {
            if ((received_CAM_countThreshold2 % 2) == 0) {
                COMALSB = RXAdata;
            } else {
                DataFromCameraThreshold2.rawData[received_CAM_countThreshold2/2] = (RXAdata << 8) | COMALSB;
            }
            received_CAM_countThreshold2++;
            if (received_CAM_countThreshold2 >= 4*CAMNUM_FROM_FLOATS) {
                received_CAM_countThreshold2 = 0;
                COMA_state = 0;
                fromCAMvaluesThreshold2[0] = DataFromCameraThreshold2.floatData[0];
                fromCAMvaluesThreshold2[1] = DataFromCameraThreshold2.floatData[1];
                fromCAMvaluesThreshold2[2] = DataFromCameraThreshold2.floatData[2];
                fromCAMvaluesThreshold2[3] = DataFromCameraThreshold2.floatData[3];
                fromCAMvaluesThreshold2[4] = DataFromCameraThreshold2.floatData[4];
                fromCAMvaluesThreshold2[5] = DataFromCameraThreshold2.floatData[5];
                fromCAMvaluesThreshold2[6] = DataFromCameraThreshold2.floatData[6];
                fromCAMvaluesThreshold2[7] = DataFromCameraThreshold2.floatData[7];
                fromCAMvaluesThreshold2[8] = DataFromCameraThreshold2.floatData[8];
                NewCAMDataThreshold2 = 1;  // Flag new data
            }
        }

        numRXA ++;
    }

    SciaRegs.SCIFFRX.bit.RXFFINTCLR = 1;
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

}

//for SerialB
#ifdef _FLASH
#pragma CODE_SECTION(RXBINT_recv_ready, ".TI.ramfunc");
#endif
__interrupt void RXBINT_recv_ready(void)
{
    RXBdata = ScibRegs.SCIRXBUF.all;

    /* SCI PE or FE error */
    if (RXBdata & 0xC000) {
        ScibRegs.SCICTL1.bit.SWRESET = 0;
        ScibRegs.SCICTL1.bit.SWRESET = 1;
        ScibRegs.SCIFFRX.bit.RXFIFORESET = 0;
        ScibRegs.SCIFFRX.bit.RXFIFORESET = 1;
    } else {
        RXBdata = RXBdata & 0x00FF;
        // Do something with recieved character
        numRXB ++;
    }

    ScibRegs.SCIFFRX.bit.RXFFINTCLR = 1;
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;
}


// for SerialC
#ifdef _FLASH
#pragma CODE_SECTION(RXCINT_recv_ready, ".TI.ramfunc");
#endif
__interrupt void RXCINT_recv_ready(void)
{
    RXCdata = ScicRegs.SCIRXBUF.all;

    /* SCI PE or FE error */
    if (RXCdata & 0xC000) {
        ScicRegs.SCICTL1.bit.SWRESET = 0;
        ScicRegs.SCICTL1.bit.SWRESET = 1;
        ScicRegs.SCIFFRX.bit.RXFIFORESET = 0;
        ScicRegs.SCIFFRX.bit.RXFIFORESET = 1;
    } else {
        RXCdata = RXCdata & 0x00FF;
        if (read_ladar_state == 0) {//wait for the starting char 'G'
            buf_index = 0;
            if (RXCdata =='G') {
                read_ladar_state = 1;
                G_count = 1;
            }
        } else if (read_ladar_state == 1) {//get the headers
            G_count += 1;//count the number of headers
            //check the status code and if it is not '0', wait for the next packet
            if (G_count == 11) {
                if (RXCdata != '0') {
                    read_ladar_state = 0;
                }
            }
            if (G_count >= 12) {//there are total 12 things before the data
                read_ladar_state = 2;
                get_dis_first = 1;
                dis_index = 0;
            }
        } else if (read_ladar_state == 2) {//get actual data
            if (RXCdata == 0x0a) {//check for line feed
                LF_count += 1;
            } else {
                LF_count = 0;
                if (get_dis_first == 1) {
                    tempscid = (RXCdata - 0x30) << 6;//first data is the top 6 bit of the distance reading
                    get_dis_first = 0;
                } else if (get_dis_first == 0) {
                    distance = tempscid + (RXCdata - 0x30);//second data is the bottom 6 bit of the distance reading
                    if (distance == 0 || distance == 6) {//error code
                        distance = LADAR_MAX_READING; //set to the max reading
                    } else if (distance == 16) { //distance is 4096mm
                        distance = 4096;
                    }
                    if (LADARpingpong == 0) {
                        //ladar_data[dis_index%228].distance_ping = distance*0.00328084; // fill in the distance_ping array
                        checkdist = distance*0.00328084;
                        if ((checkdist > 0.25) && (checkdist < 20.0)) {
                            ladar_data[dis_index].distance_ping = checkdist; // fill in the distance_ping array
                        } else {
                            numRCXerrors++;
                            ladar_data[dis_index].distance_ping = ladar_data[dis_index].distance_pong;
                        }
                    } else if (LADARpingpong == 1) {
                        //ladar_data[dis_index%228].distance_pong = distance*0.00328084; // fill in the distance_pong array
                        checkdist = distance*0.00328084;
                        if ((checkdist >= 0.25) && (checkdist < 20.0)) {
                            ladar_data[dis_index].distance_pong = checkdist; // fill in the distance_ping array
                        } else {
                            numRCXerrors++;
                            ladar_data[dis_index].distance_pong = ladar_data[dis_index].distance_ping;
                        }
                    }
                    dis_index += 1;
                    get_dis_first = 1;
                }
            }
            if (LF_count == 2) { //two consecutive line feed means the end of the current data stream
                read_ladar_state = 0;
                print_dis_index = dis_index;
                PostSWI2(); // Manually cause the interrupt for the SWI2
                LADARpingpong = 1-LADARpingpong;
            }
        }
        buf[buf_index % 477] = RXCdata;//fill in the buf array, debug purpose
        buf_index++;
        numRXC ++;

