shreym01/SE423_repo/F28379dSerial_withLCDcontrast.c
    }

    ScicRegs.SCIFFRX.bit.RXFFINTCLR = 1;
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP8;
}


//for SerialD
#ifdef _FLASH
#pragma CODE_SECTION(RXDINT_recv_ready, ".TI.ramfunc");
#endif
__interrupt void RXDINT_recv_ready(void)
{
    uint16_t i = 0;//for loop
    RXDdata = ScidRegs.SCIRXBUF.all;

    /* SCI PE or FE error */
    if (RXDdata & 0xC000) {
        ScidRegs.SCICTL1.bit.SWRESET = 0;
        ScidRegs.SCICTL1.bit.SWRESET = 1;
        ScidRegs.SCIFFRX.bit.RXFIFORESET = 0;
        ScidRegs.SCIFFRX.bit.RXFIFORESET = 1;
    } else {
        RXDdata = RXDdata & 0x00FF;
        if (com_state == 0) {
            if (RXDdata == '*') {
                com_state = 1; //for receiving path
            } else if (RXDdata == 'O') {
                com_state = 2; //for receiving optitrack data
            } else {
                com_state = 0;
            }
        } else if (com_state == 1) {
            if (RXDdata == '*') {
                com_state = 10; // into the read mode
                received_path_count = 0;
                newAstarPath = 0;
            } else if (RXDdata == '$') {
                com_state = 30;
                received_LV_count = 0;
            } else if (RXDdata == '!') {
                com_state = 40;
                received_CMD_count = 0;
            } else {
                com_state = 0;
            }
        } else if (com_state == 10) {  // this should not occurred left it here for future code with A* path planning
            path_received[received_path_count] = RXDdata;
            received_path_count++;
            if (received_path_count >= 81) {
                received_path_count = 0;
                com_state = 0;
                newAstarPath = 1;
            }
        } else if (com_state == 2) {
            if (RXDdata == 'p'){
                com_state = 20;
            } else {
                com_state = 0;
            }
        } else if (com_state == 20) {
            if (RXDdata == 't'){
                com_state = 21;
            } else {
                com_state = 0;
            }
        } else if (com_state == 21) {
            if (RXDdata == 'i'){
                com_state = 22;
            } else {
                com_state = 0;
            }
        } else if (com_state == 22) {
            if (RXDdata == ':'){
                com_state = 23;
                //                received_opti_count = 0;
            } else {
                com_state = 0;
            }
        } else if (com_state == 23) {
            if (received_opti_count % 2 == 0){  // this is for motion tracking system  left for future code
                tempLSB = RXDdata;
            } else {
                optirx.rawData[received_opti_count/2] = (RXDdata << 8)|tempLSB;
            }
            received_opti_count++;
            if (received_opti_count >= OPTITRACKDATASIZE*4) {
                if (new_optitrack == 0) {
                    for (i=0;i<OPTITRACKDATASIZE;i++) {  // x, y, heading, trackableID, framecount
                        Optitrackdata[i] = optirx.floatData[i];
                    }
                    new_optitrack = 1;
                }
                received_opti_count = 0;
                com_state = 0;
            }
        } else if (com_state == 30) {
            if ((received_LV_count % 2) == 0) {
                tempLSB = RXDdata;
            } else {
                DataFromLabView.rawData[received_LV_count/2] = (RXDdata << 8)|tempLSB;
            }
            received_LV_count++;
            if (received_LV_count >= 4*LVNUM_TOFROM_FLOATS) {
                received_LV_count = 0;
                com_state = 0;
                fromLVvalues[0] = DataFromLabView.floatData[0];
                fromLVvalues[1] = DataFromLabView.floatData[1];
                fromLVvalues[2] = DataFromLabView.floatData[2];
                fromLVvalues[3] = DataFromLabView.floatData[3];
                fromLVvalues[4] = DataFromLabView.floatData[4];
                fromLVvalues[5] = DataFromLabView.floatData[5];
                fromLVvalues[6] = DataFromLabView.floatData[6];
                fromLVvalues[7] = DataFromLabView.floatData[7];
                NewLVData = 1;  // Flag new data
            }
        } else if (com_state == 40) {
            if ((received_CMD_count % 2) == 0) {
                tempLSB = RXDdata;
            } else {
                DataFromLinuxCMD.rawData[received_CMD_count/2] = (RXDdata << 8)|tempLSB;
            }
            received_CMD_count++;
            if (received_CMD_count >= 4*CMDNUM_FROM_FLOATS) {
                received_CMD_count = 0;
                com_state = 0;

                LinuxCommands[0] = DataFromLinuxCMD.floatData[0];
                LinuxCommands[1] = DataFromLinuxCMD.floatData[1];
                LinuxCommands[2] = DataFromLinuxCMD.floatData[2];
                LinuxCommands[3] = DataFromLinuxCMD.floatData[3];
                LinuxCommands[4] = DataFromLinuxCMD.floatData[4];
                LinuxCommands[5] = DataFromLinuxCMD.floatData[5];
                LinuxCommands[6] = DataFromLinuxCMD.floatData[6];
                LinuxCommands[7] = DataFromLinuxCMD.floatData[7];
                LinuxCommands[8] = DataFromLinuxCMD.floatData[8];
                LinuxCommands[9] = DataFromLinuxCMD.floatData[9];
                LinuxCommands[10] = DataFromLinuxCMD.floatData[10];
                newLinuxCommands = 1;  // Flag new data

            }
        }
    }
    numRXD ++;
    ScidRegs.SCIFFRX.bit.RXFFINTCLR = 1;
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP8;
}


// SerialA only setup for Tera Term connection
char serial_printf_bufSCIA[BUF_SIZESCIA];

uint16_t serial_printf(serialSCIA_t *s, char *fmt, ...)
{
    va_list ap;

    va_start(ap,fmt);
    vsprintf(serial_printf_bufSCIA,fmt,ap);
    va_end(ap);

    return serial_sendSCIA(s,serial_printf_bufSCIA,strlen(serial_printf_bufSCIA));
}


void LCD_Contrast(int16_t contrast)
{
    char sendmsg[24];

    // Add header information and pad end of transfer with spaces to clear display
    sendmsg[0] = 0xFE;
    sendmsg[1] = 0x50;
    sendmsg[2] = (char) contrast;
    serial_sendSCIB(&SerialB,sendmsg,3);
}

//For Text LCD  SCIB only
char UART_printf_bufferSCIB[BUF_SIZESCIB];
void UART_vprintfLine(unsigned char line, char *format, va_list ap)
{
    char sendmsg[24];

    int i;

    vsprintf(UART_printf_bufferSCIB,format,ap);

    // Add header information and pad end of transfer with spaces to clear display
    sendmsg[0] = 0xFE;
    sendmsg[1] = 'G';
    sendmsg[2] = 1;
    sendmsg[3] = line;
    for (i=4;i<24;i++) {
        if (i >= strlen(UART_printf_bufferSCIB)+4) {
            sendmsg[i] = ' ';
        } else {
            sendmsg[i] = UART_printf_bufferSCIB[i-4];
        }
    }
    serial_sendSCIB(&SerialB,sendmsg,24);
}

void UART_printfLine(unsigned char line, char *format, ...)
{
    va_list ap;
    va_start(ap, format);
    UART_vprintfLine(line,format,ap);
}


